#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=absolutely-helped-monkfish]
random_password.master: Refreshing state... [id=none]
tls_private_key.jumpbox: Refreshing state... [id=f85594efcde6a52be7e1535fe75e0ecd0596cf80]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
data.aws_availability_zones.available: Reading...
data.aws_ami.latest_amazon_linux: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a28d56b4354e1555]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|3682813B-FD26-444E-9A4A-059E260A3BB7]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
data.aws_secretsmanager_secret_version.password: Reading...
data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-05c89af705fc8fb3c]
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|AWSCURRENT]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06f715bf935e801cd]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-034fb73568e35a2ad]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cea1fda906409973]
aws_security_group.database_sg: Refreshing state... [id=sg-07425be98e514225f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbf6497c54be8733]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-09ae4c9f7722b0ff8]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-035759611c538ce80]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0559b61f5a74fcac2]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02d7c67035e5124fa]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0634c8e7fd10a8009]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-0021f9c618a3119d0]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0aa60a64fc5b1a696]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-027947bcf325829ac]
aws_security_group_rule.db_egress_all: Refreshing state... [id=sgrule-442621240]
aws_security_group.sm_sg: Refreshing state... [id=sg-0d150a18aaa621a04]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-073098b78e8aa32b6]
aws_security_group_rule.database_sg_from_jumpbox_sg: Refreshing state... [id=sgrule-4113702315]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-05a85d90c903644d5]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0b0356ee59303c51f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fb53b1aed3271b31]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bcce440882e2dc3f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-027947bcf325829ac1080289494]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-022eb3a6d85fa06a7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0327b452f427d62fc]
aws_db_instance.vector_db: Refreshing state... [id=db-YISND6N7BEMRMBM6WIYBKS3WJA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_instance.jumpbox will be created
  + resource "aws_instance" "jumpbox" {
      + ami                                  = "ami-05c89af705fc8fb3c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jumpbox-key-pair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0cea1fda906409973"
      + tags                                 = {
          + "Name" = "jumpbox-instance"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "jumpbox-instance"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-09ae4c9f7722b0ff8",
        ]
    }

  # aws_key_pair.jumpbox will be created
  + resource "aws_key_pair" "jumpbox" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "jumpbox-key-pair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDiKUAQx+x6XEj9XEwBKsUhErnTtfr07Hu2dMUgH5h1X7+FBuR8lwwhspaMoliBIU3oAIm7NUJd+DKzUtQs0ZXNaqln5RJWAz6WhJdzHosWvklrpdJwzgvKhPLbiUVxNorYZCW+MYbz+HC9ovRv0ywiCdBYmRwGXIc4gZWJryzrani3RHM4JMZL6cqBD3qVIyfx24OKPVvHorYWM//ouVsiV/yiP8r7QoQJge3FnzL12w0eOwMkZtVL7jE6vY1CYn8g8zueQsWaa0GRN1S+ai6A66lLfodiJY5IuNZ/UNu5CC8Gd8xxkRclsc/oSHRBDY4Fv37UFxr1960l3OMkskft/P3kppixSjxCAiUqjNvUVcW7tuhVIwdq6JJQ/hXVvQZg/ZDolwhvQFtrcKezUKOcwkhw2dKjbDNNODbSEeCgBAZU3P52SRYGdqEpiZYvi5HP9TFq2fsT1ke9hqzXhtem8AFJXS0rxIbWzbsUAG8p8j4WU0vD1XhnpY1qiZH2N2gsuQQVcnk3XxMQ4pLdtKG922yr6WXcSEVfkrgMwl0iOL7s6Z5E4bMUN1lAKrwr0235G0CJOLmEjjiJvWWyal6m0BrP/YI1M7UXQi4Dih19sutyP7X4yoBZWxYCUewpuAQmQwiLBqbK26X9ZEsvLaTV36YS+EWmckuXwVcKL5ngsw=="
      + tags_all        = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
    }

  # aws_security_group.bedrock_sg will be updated in-place
  ~ resource "aws_security_group" "bedrock_sg" {
        id                     = "sg-073098b78e8aa32b6"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Bedrock runtime sg"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Bedrock runtime sg"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "bedrock-runtime-sg"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.lambda_ingestion_sg will be created
  + resource "aws_security_group" "lambda_ingestion_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Lambda Ingestion"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "lambda-ingestion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0a28d56b4354e1555"
    }

  # aws_security_group.sm_sg will be updated in-place
  ~ resource "aws_security_group" "sm_sg" {
        id                     = "sg-0d150a18aaa621a04"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Secrets Manager"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Secrets Manager"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "secret-manager-sg"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.bedrock_endpoint will be updated in-place
  ~ resource "aws_vpc_endpoint" "bedrock_endpoint" {
        id                    = "vpce-0327b452f427d62fc"
      ~ security_group_ids    = [
          - "sg-0d150a18aaa621a04",
          + "sg-073098b78e8aa32b6",
        ]
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ingestion.aws_s3_bucket.ingestion_source_storage will be created
  + resource "aws_s3_bucket" "ingestion_source_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "levio-demo-fev-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-ingestion"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
    }

  # module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-ingestion-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
    }

  # module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-ingestion"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-ingestion"
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-ingestion"
      + id                             = (known after apply)
      + image_uri                      = "levio-demo-fev-ingestion:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PGVECTOR_COLLECTION_NAME"      = "emails-embeddings"
              + "PGVECTOR_DATABASE"             = "vector_db"
              + "PGVECTOR_DRIVER"               = "psycopg2"
              + "PGVECTOR_HOST"                 = "vector-db.cyxgx8pmxirg.us-west-2.rds.amazonaws.com"
              + "PGVECTOR_PASSWORD_SECRET_NAME" = "arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond"
              + "PGVECTOR_PORT"                 = "5432"
              + "PGVECTOR_USER"                 = "postgres_admin"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-034fb73568e35a2ad",
            ]
          + subnet_ids                  = [
              + "subnet-0bbf6497c54be8733",
              + "subnet-0cea1fda906409973",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 9 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Planning and apply infrastructure`*